package com.leokorol.testlove.tests.texts

object Questions {
    val Part1 = arrayOf(
        QuestionWithVariants(
            "Вам нравится внешность вашего избранника?", arrayOf(
                "Да, очень",
                "Нравится",
                "Нравится со всеми недостатками",
                "Главное в нём – не внешняя, а внутренняя красота",
                "Хотел бы немного изменить внешность партнёра",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вас полностью устраивает возраст вашего избранника?", arrayOf(
                "Да",
                "Хотелось бы немного старше",
                "Хотелось бы немного моложе",
                "Возраст не имеет значения",
                "Уже полностью смирился с возрастом своего партнёра",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы любите объятия и поцелуи от вашего партнёра?", arrayOf(
                "Да, очень",
                "Не люблю",
                "Обычно обнимаю и целую я, а не меня",
                "Иногда раздражают",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            """
    Какое у вас возникает чувство, когда вы видите 
    целующуюся пару в общественном месте?
    
    """.trimIndent(), arrayOf(
                "Смущение",
                "Стыд за них",
                "Зависть",
                "Безразличие",
                "Радость за них",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Нужно ли признаваться в любви и как часто своему партнёру?", arrayOf(
                "Каждый день",
                "Пару раз в неделю",
                "Часто не нужно",
                "Одного раза хватит",
                "Я поступками выражаю свою любовь",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Оцените готовность прямо сейчас признаться в любви своему партнёру?", arrayOf(
                "10-30",
                "30-50",
                "50-50",
                "50-70",
                "70-90",
                "90-100"
            )
        ),
        QuestionWithVariants(
            "Можно ли со временем полюбить человека, который сейчас любит, а вы его – нет?",
            arrayOf(
                "Нужно что бы сразу оба полюбили",
                "Всё может быть",
                "Можно, но вряд ли",
                "Если сразу не пришли чувства, то лучше и не надеяться",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вам важно знать всё о прошлой жизни вашего партнёра?", arrayOf(
                "Да, важно: по прошлому можно лучше понять человека",
                "Прошлое – не важно, главное – то, что происходит сейчас",
                "Очень. Но я стесняюсь задавать некоторые вопросы об этом",
                "Боюсь разочароваться",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете, можно ли спрашивать о количестве сексуальных связей партнёра до встречи с вами?",
            arrayOf(
                "Можно спросить если уверен, что не расстроишься",
                "Думаю, нет",
                "Нужно",
                "Мне это не важно",
                "Боюсь встречного ответа",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы хотели бы детей от своего партнёра?", arrayOf(
                "Да",
                "Нет",
                "Возможно",
                "Не очень люблю детей",
                "Уже есть общие дети",
                "Я пока не уверен в партнёре",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы верите в любовь с первого взгляда?", arrayOf(
                "О да, у нас прям так и было",
                "Не верю, это глупо",
                "Верю, так может быть",
                "Любовь возникает только со временем",
                "У меня было такое",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Что вы будете делать, если вы – любите, а вас нет?", arrayOf(
                "Добиваться взаимной любви",
                "Разорву все связи с этим человеком",
                "Буду надеяться на взаимность",
                "Страдать",
                "Искать другой объект для внимания к себе",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы смогли простить измену вашему партнёру?", arrayOf(
                "Да",
                "Нет",
                "Смотря, какая измена",
                "Сначала отомщу, а там посмотрим",
                "Затрудняюсь ответить",
                "Прощу, но потом сам буду изменять",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Можно ли изменить своему партнёру за большие деньги, если кто-то из близких смертельно болен?",
            arrayOf(
                "Да",
                "Нет",
                "Можно, если никто не узнает",
                "Я попробую одолжить или заработать по-другому",
                "Конечно, пойду на всё ради спасения жизни",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы охарактеризуете свой сексуальный темперамент?", arrayOf(
                "Ласковый и нежный",
                "Страстный и жесткий",
                "По настроению",
                "Смотря, какой партнёр",
                "Пассивный люблю, когда всё делают за меня",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вас всё устраивает в сексе с вашим нынешним партнёром?", arrayOf(
                "Абсолютно, я получаю удовольствие всегда",
                "Хочу больше страсти",
                "Хочу больше внимания к моим желаниям",
                "Меня не устраивает сейчас наш секс",
                "Не всё, я стараюсь, а он нет",
                "У нас нет секса"
            )
        ),
        QuestionWithVariants(
            "Можно ли расстаться с партнёром от недостатка в сексе?", arrayOf(
                "Конечно",
                "Возможно",
                "Смотря какие обстоятельства на это повлияли",
                "Это не главное",
                "Без секса нет любви",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Был ли у вас в жизни секс без чувств к человеку?", arrayOf(
                "Да",
                "Нет",
                "Я только по любви",
                "Ради опыта был",
                "Был в не трезвом состоянии в какой-то компании",
                "Всякое было"
            )
        ),
        QuestionWithVariants(
            "Готовы ли вы пойти на любые эксперименты в сексе ради вашего партнера?", arrayOf(
                "Конечно",
                "Я не приемлю этого",
                "Если это только без посторонних людей и боли",
                "Мы любим разные эксперименты",
                "Я стесняюсь",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как часто вы хотели бы заниматься сексом с вашим партнёром?", arrayOf(
                "Каждый день",
                "Через день",
                "Пару раз в неделю",
                "Раз в месяц",
                "Мне это не важно",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы думаете, в прошлом вы любили по-настоящему?", arrayOf(
                "Да",
                "Нет",
                "Несколько раз",
                "Казалось, что да, но на самом деле нет",
                "Не знаю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы ранее состояли в официальном браке?", arrayOf(
                "Да",
                "Нет, но хочу",
                "Два раза",
                "Более двух",
                "Нет и не собираюсь пока",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к гражданскому браку?", arrayOf(
                "Отлично",
                "Нормально",
                "Не очень",
                "Плохо",
                "Я считаю это не серьезно",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Сколько времени, по-вашему, нужно быть вместе паре до брака?", arrayOf(
                "Не менее года",
                "Пока не появятся дети",
                "Брак не обязателен",
                "Минимум полгода",
                "Как получится",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Часто ли вы прибегаете к манипуляции в отношениях?", arrayOf(
                "Бывает",
                "Да, часто",
                "Стараюсь так не делать",
                "Только в пользу наших совместных отношений",
                "Нет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если бы ваш партнёр вам изменил как вы думаете в чем причина?", arrayOf(
                "Недостаток внимания и любви от вас",
                "Партнёр значит легкомысленный",
                "Прошла любовь завяли кактусы",
                "Ему не хватало поддержки от вас",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Можно ли прожить всю жизнь с одним человеком без измен?", arrayOf(
                "Крайне сложно",
                "Можно, но сомневаюсь, что мне не изменят",
                "Конечно, если партнёры дают друг другу всё",
                "Нет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Во сколько лет, по вашему мнению, можно вступать в брак и создавать семью?", arrayOf(
                "18-22",
                "22-25",
                "25-30",
                "Только после 30",
                "От 18 лет, по взаимной любви, с умственной зрелостью и ответственностью перед партнёром и будущими детьми"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к многодетным семьям (более трёх детей)? ", arrayOf(
                "Как к счастливой семье",
                "Не понимаю зачем столько детей",
                "Как к легкомысленным людям, особенно бедным",
                "Если семья живёт в достатке, то хорошо",
                "Жаль детей, кто-то из них точно не получит нужной родительской любви и внимания"
            )
        ),
        QuestionWithVariants(
            "Сколько вы хотите иметь детей?", arrayOf(
                "Одного ребёнка",
                "Двоих",
                "Чем больше, тем лучше",
                "Количество не важно",
                "Не хочу детей пока и не думаю об этом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к абортам?", arrayOf(
                "Категорично против",
                "Нормально, всякое бывает",
                "Плохо, но допускаю при крайней необходимости",
                "Мне всё равно",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Хотели бы вы при родах общего ребёнка находится в одном помещении с вашим партнёром?",
            arrayOf(
                "Да, мне бы было приятно",
                "Нет, мне бы было не приятно",
                "Поддержка при взаимном согласии очень важна в такой ситуации",
                "Это слишком личное и отношения в сексуальной жизни могут испортиться",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы смогли воспитывать чужого ребёнка?", arrayOf(
                "Да, если он не проблемный",
                "Нет, даже если он и хороший",
                "Смотря какой возраст",
                "Нет чужих детей",
                "Смотря, какой партнёр и его ребёнок в целом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы смогли отказаться от своего ребёнка инвалида?", arrayOf(
                "Да, не хочу мучаться",
                "Нет, пойду на всё ради него",
                "Если инвалидность тяжелая, то да",
                "Отдам родителям",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы понимаете, что в семейной жизни присутствует много бытовых разногласий, которые могут разладить ваши отношения?",
            arrayOf(
                "Прекрасно понимаю",
                "Понимаю и знаю как их решить",
                "Не считаю это проблемой, если пара умеет договариваться",
                "Нужно заранее решить кто в чём принимает решения",
                "Нужно выбрать главного во всём и с него спрос",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Можно ли разойтись с партнёром из-за бытовых проблем?", arrayOf(
                "Конечно, хочу жить в комфорте",
                "Нет, любовь дороже, возьму всё на себя",
                "Буду до последнего пробовать договориться",
                "Буду ссориться пока не поступят по-моему",
                "Нужно помогать друг другу во всём, возможно даже учится чему-то и проблем не будет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какие взаимоотношения для вас ближе из перечисленных?", arrayOf(
                "Спокойные и стабильные",
                "Как на вулкане, с нервами, переживаниями и любовной страстью",
                "Нежность, забота о друг друге и поддержка",
                "Веселье и отдых от внешнего мира",
                "Без обязательств",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Счастливое ли у вас было детство?", arrayOf(
                "Обычное, как у большинства",
                "Да, но есть детская травма",
                "Очень счастливое, мне дали всё что могли",
                "Из-за негативного воздействия близких людей был не счастлив",
                "Я был счастлив только когда оставался один",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы любите своих родителей? Часто говорите об этом им?", arrayOf(
                "Очень и говорю об этом часто",
                "У меня осталась обида с детства, поэтому не говорю",
                "Говорю очень редко, стесняюсь",
                "Люблю и стараюсь показывать делами, слова не так важны",
                "Да, но только недавно начал говорить об этом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Выберите, что вам удобнее для совместного проживания?", arrayOf(
                "Своя семья без детей и близких родственников",
                "Семья и близкие родственники",
                "Своя семья с детьми",
                "Мне пока нравится жить с родственниками",
                "Мне пока нравится жить одному",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к разводам?", arrayOf(
                "Плохо. Это как разрушение семьи",
                "Отлично, было бы хуже, если бы законом это было запрещено",
                "Зачем тогда жениться",
                "Развод часть жизни если ошибся с выбором",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как, по-вашему, более правильно воспитывать детей?", arrayOf(
                "Подавать пример",
                "В строгости",
                "В любви и заботе",
                "В любви и в строгости что бы уважали родителей",
                "Быть другом во всём и учить чувству справедливости",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Кто должен больше уделять времени в воспитании детей?", arrayOf(
                "Отец",
                "Мать",
                "Оба родителя постоянно",
                "Родители и все близкие родственники",
                "Если речь о девочке мама, если о мальчике отец",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если бы вы могли дать только один совет своему ребёнку, какой бы вы дали?", arrayOf(
                "Постоянно учись и повышай квалификацию",
                "Делай и твори только хорошее, и добро к тебе вернется",
                "Никогда не сдавайся",
                "Не верь никому",
                "Будь справедлив",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Когда вы впервые увидели своего нынешнего партнёра что вы подумали?", arrayOf(
                "Какой он симпатичный",
                "Он мне поначалу не понравился",
                "Мне нравилось наблюдать за ним",
                "Мне нравилось говорить с ним",
                "Чувствовалось смущение из-за сильной симпатии",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Ваши самые длительные отношения в жизни?", arrayOf(
                "Меньше, чем полгода",
                "Год",
                "Два года",
                "Больше трёх лет",
                "Больше шести лет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Сколько серьёзных отношений за всю жизнь у вас было?", arrayOf(
                "1-7",
                "8-15",
                "16-21",
                "22-35",
                "Более 35ти",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Сколько мимолётных несерьёзных влечений с продолжением на секс у вас было?", arrayOf(
                "1-7",
                "8-15",
                "16-21",
                "22-35",
                "Более 35",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы думаете, может ли развестись пара, если женщина не выполняет свои обязанности по организации быта и домашнего уюта?",
            arrayOf(
                "Конечно",
                "Не разведутся, если всё остальное хорошо",
                "Рано или поздно разведутся из-за ссор",
                "Нет, если женщина будет стараться и учится этому",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы думаете, может ли развестись пара, если муж не выполняет свои обязанности по обеспечению семьи?",
            arrayOf(
                "Конечно",
                "Не разведутся, если всё остальное хорошо",
                "Рано или поздно разведутся из-за ссор",
                "Нет, если мужчина будет стараться и учится этому",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если один из партнёров употребляет алкоголь или наркотики и никакие уговоры не действуют нужно ли разойтись?",
            arrayOf(
                "Конечно",
                "Попробую помочь в лечении, а там посмотрим",
                "Нет, от любимых не отказываются",
                "Смотря в каких количествах",
                "Попробую тоже что бы понять, что он в этом нашел",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "У вас есть судимые в семье?", arrayOf(
                "Есть – за незначительные нарушения закона",
                "Нет",
                "Есть – за серьезные нарушения",
                "Не знаю",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Хотели бы вы через год видеть вашего нынешнего партнёра рядом с вами?", arrayOf(
                "Да конечно",
                "Если он не изменится в некоторых вещах, то нет",
                "Пока не знаю",
                "Хочу всегда быть вместе",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Самые важные для вас недостатки в вашем нынешнем партнёре которые хотелось бы изменить, сколько их?",
            arrayOf(
                "1-2",
                "Больше трёх",
                "Значительных нет, он пытается быть лучше",
                "Которые хотел бы изменить нет",
                "Их многовато",
                "Их нет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Что вам больше всего нравится в вашем партнёре?", arrayOf(
                "Честность и доброта",
                "Красота и харизма",
                "Ум и чувство юмора",
                "Влияние в обществе и финансовая независимость",
                "Забота о вас",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы изменяли хоть раз в своей жизни будучи в серьёзных отношениях или находясь в браке?",
            arrayOf(
                "Да, изменял только с разными людьми",
                "Никогда",
                "Было до 5 раз",
                "Был постоянный партнёр для измен",
                "Было несколько постоянных партнёров",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Когда вы поняли, что действительно полюбили вашего нынешнего партнёра?", arrayOf(
                "Почти сразу",
                "Спустя несколько месяцев",
                "Когда полностью доверились и открылись друг другу",
                "Спустя очень долгое время",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какая модель общения у вас с вашим партнёром во время спора или размолвки?", arrayOf(
                "Обычно я всё решаю и со мной партнёр не спорит",
                "Много обсуждаем и разговариваем пока не придём к общему и правильному решению",
                "Я всегда стараюсь первым сгладить ситуацию",
                "Обычно партнёр пытается сгладить ситуацию",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Где и как вы мечтаете жить с семьёй и детьми?", arrayOf(
                "В доме в пригороде со своим двором",
                "В хорошей квартире в центре мегаполиса",
                "Мне всё равно где",
                "Где-нибудь на берегу моря",
                "Пока не знаю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Куда прямо сейчас вы бы отправились в путешествие со своим партнёром?", arrayOf(
                "Всё равно, главное тепло и пляж",
                "Туда, где можно активно отдохнуть лыжи, сноуборд и т.д.",
                "В какое-то очень необычное место без цивилизации",
                "В дорогое место с высоким уровнем дохода и обслуживания",
                "Не хочу сейчас никуда",
                "Другой ответ"
            )
        )
    )
    val Part2 = arrayOf(
        QuestionWithVariants(
            "Бываете ли вы ленивым человеком?", arrayOf(
                "Нет",
                "Крайне редко",
                "Да, но в меру",
                "Борюсь со своей ленью",
                "Ленивец – моё тотемное животное!",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Ваши 2 основные черты характера по отношению к другим людям? ", arrayOf(
                "Грубость",
                "Правдивость",
                "Тактичность",
                "Лживость",
                "Замкнутость",
                "Общительность",
                "Дружелюбие"
            )
        ),
        QuestionWithVariants(
            "Ваши 2 основные черты характера по отношению к делу?", arrayOf(
                "Добросовестность",
                "Ответственность",
                "Трудолюбие",
                "Леность",
                "Доведение дел до конца",
                "Откладывание дел"
            )
        ),
        QuestionWithVariants(
            "Ваши 2 основные черты характера по отношению к себе?", arrayOf(
                "Самовлюбленность",
                "Самокритичность",
                "Скромность",
                "Гордость",
                "Самоуверенность",
                "Самоутверждение"
            )
        ),
        QuestionWithVariants(
            "Ваши 2 основные черты характера к собственности?", arrayOf(
                "Жадность",
                "Бережливость",
                "Щедрость",
                "Расточительность",
                "Неряшливость",
                "Аккуратность"
            )
        ),
        QuestionWithVariants(
            "Сколько часов в сутки в целом вы спите?", arrayOf(
                "Менее 6",
                "7-8",
                "9 и более",
                "График не стабильный, всегда по-разному",
                "Не знаю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы ревнивый человек?", arrayOf(
                "Да, очень",
                "Да, но стараюсь меньше это показывать",
                "Нет, это чувство для людей с комплексами",
                "Только если есть реальный повод",
                "Только если нет доверия к человеку",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Чем вас можно действительно разозлить?", arrayOf(
                "Причин может быть много",
                "Ложью и неискренностью",
                "Бывает люди просто раздражают и бесят",
                "Навязыванием своего мнения",
                "Не справедливостью и хитростью",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как часто вы злитесь?", arrayOf(
                "Каждый день и очень сильно",
                "Очень редко",
                "Когда сталкиваюсь в очередной раз с тем, что мне не нравится и мое терпение не выдерживает",
                "Часто, но не сильно",
                "Для меня злость как самовыражение так как по-другому не понимают",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вам часто приходилось драться за себя и других людей?", arrayOf(
                "Да и мне нравилось",
                "К сожалению, да",
                "Редко",
                "Не приходилось",
                "До сих пор иногда бью людей",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Обижали ли вас в детстве ровесники?", arrayOf(
                "Да, часто",
                "Редко",
                "Я сам обижал первым что бы меня не обижали",
                "Нет, со мной только дружили",
                "До сих пор обижают",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Обижали ли вас родители в детстве?", arrayOf(
                "Да, не заботились обо мне, не уделяли внимания",
                "Да, били и унижали",
                "Не обижали",
                "Да, и я со временем мстил в ответ",
                "В основном заставляли много работать",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как часто вы используете нецензурную лексику?", arrayOf(
                "Часто",
                "Всегда, без этого никак",
                "Бывает, но очень редко",
                "Никогда",
                "Затрудняюсь",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Внимательно ли вы слушаете людей при разговоре?", arrayOf(
                "Да я очень внимательный и наблюдательный",
                "Если мне тема обсуждения интересна, то да",
                "Очень редко бываю внимательным",
                "Только делаю вид что внимательно слушаю",
                "Мне не интересно слушать долго людей",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какой вид юмора вы предпочитаете?", arrayOf(
                "Абсурдный",
                "Импровизация",
                "Сарказм",
                "Черный юмор",
                "Ограничиваюсь анекдотами",
                "Люблю разносторонний юмор",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы считаете себя добрым человеком?", arrayOf(
                "К сожалению, слишком добрый",
                "Добрый, но в меру и не со всеми",
                "Я скорее всего справедливый",
                "Добрый к людям, но к себе злой",
                "Да, часто помогаю людям",
                "Не считаю себя добрым это слабость"
            )
        ),
        QuestionWithVariants(
            "Какие качества из перечисленных в людях вы считаете самыми плохими?", arrayOf(
                "Лживость и скрытность",
                "Лень и безграмотность",
                "Лицемерие и подхалимство",
                "Гордыня и завистливость",
                "Все эти качества не допустимы у нормального человека",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Сентиментальный ли вы человек?", arrayOf(
                "Да очень",
                "Бывает, но редко",
                "Есть отдельные категории тем, когда я сентиментальный, а так нет",
                "Нет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "В каких случаях вы можете обидеться на близких вам людей?", arrayOf(
                "Когда подшучивают надо мной при других людях",
                "Когда меня не слушают",
                "Когда обесценивают мои действия",
                "Когда меня оскорбляют",
                "Когда меня критикуют",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы могли переехать жить в другую страну, если вас об этом попросит партнёр?",
            arrayOf(
                "Да конечно",
                "Мне всё равно где жить",
                "Если я не буду привязан к месту работой и делами",
                "Думаю, нет",
                "Смотря в какую страну",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Что на данный момент для вас важнее в жизни?", arrayOf(
                "Карьера",
                "Семья",
                "Здоровье",
                "Интеллектуальное развитие",
                "Духовное развитие",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Злитесь ли вы если оказывается, что ваш партнёр прав, а вы нет?", arrayOf(
                "Да, злюсь и стою на своём",
                "Немного расстроюсь, но признаюсь в том, что не прав",
                "Буду спорить пока не закончатся аргументы",
                "Нет, истина превыше всего",
                "Когда как",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вас раздражает, когда ваш партнёр долго говорит по телефону или переписывается?",
            arrayOf(
                "Да",
                "Если не по работе или важному делу, то да",
                "Иногда",
                "Нет",
                "Я вообще не обращаю на это внимания",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какой досуг из цифровых развлечений вам близок?", arrayOf(
                "Люблю поиграть в ПК игры",
                "Играю на приставке",
                "Смотрю в основном фильмы",
                "Смотрю телевизор",
                "Игры в телефонах и планшетах",
                "Никакие из перечисленных"
            )
        ),
        QuestionWithVariants(
            "К чему вы больше всего проявляете интерес из перечисленных вариантов?", arrayOf(
                "Наука и техника",
                "Жизнь артистов и звёзд",
                "Законы и политика",
                "Жизнь в других странах",
                "Жизнь других людей",
                "Мне интересно практически всё",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы смогли бы прожить год на необитаемом острове?", arrayOf(
                "Да смог бы",
                "Если со своим нынешним партнёром, то да",
                "Думаю, нет",
                "Только если за деньги",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к домашним животным?", arrayOf(
                "Отлично, у меня их два и более",
                "Хорошо, есть один любимчик",
                "Надоедает ухаживать за ними",
                "Плохо",
                "Люблю, но заводить не буду",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к религиозным людям?", arrayOf(
                "Отлично, сам такой",
                "Нормально, это дело каждого",
                "Не очень",
                "Если не навязывают свои предпочтения, то я спокоен",
                "Смотря, какая религия",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какую музыку вы предпочитаете слушать?", arrayOf(
                "В основном то, что популярно",
                "Тяжелую музыку",
                "Реп, андеграунд",
                "Классика и джаз",
                "Транс и клубную",
                "Шансон",
                "Я меломан слушаю очень разные направления",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если ваш партнёр любит музыку, которая вам не нравится, вы будете его убеждать разными способами ее не слушать?",
            arrayOf(
                "Да, при любой удобной возможности",
                "Если он будет её слушать при мне, то да",
                "Нет, никогда",
                "Буду ему мстить и включать то, что не нравится ему",
                "Буду тоже с ним слушать пока не пойму почему она ему нравится",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Считаете ли вы себя счастливым человеком?", arrayOf(
                "Да, я всегда стараюсь улучшить свою жизнь",
                "Когда как, чего-то не хватает",
                "Не знаю",
                "Не очень",
                "Я сейчас несчастен",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете кто более развит в плане построений правильных отношений в вашей паре?",
            arrayOf(
                "Думаю, я",
                "Мы оба",
                "Не понимаю вопрос",
                "Мы оба ещё развиваемся",
                "Мой партнёр более развит в этом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как часто ваши мнения с партнёром расходятся?", arrayOf(
                "Часто, считаю у нас много разных взглядов на жизнь",
                "Иногда бывает, но приходим к общему мнению",
                "Редко, обычно у нас схожие мнения",
                "Не помню",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы любите спорить?", arrayOf(
                "Да, что бы доказать свою правоту",
                "Да, но ради истины, я всегда готов менять свое мнение",
                "Мне всё равно какая цель, лишь бы поспорить",
                "Не люблю спорить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Считаете ли вы важным развиваться духовно?", arrayOf(
                "Конечно",
                "Да, но в основном с целью дополнительных знаний",
                "Да, в основном нравственное совершенствование",
                "Да, мне интересен смысл человеческого предназначения",
                "Мне кажется, это всё какой-то бред",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы медитируете?", arrayOf(
                "Да",
                "Очень редко",
                "Пробовал, не понял смысл",
                "Нет",
                "Не понимаю о чём речь",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы мастурбируете?", arrayOf(
                "Да, часто",
                "Иногда",
                "Бывает, но редко",
                "Больше года этого не делал",
                "Очень давно это не делаю",
                "Нет"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете позволительна ли мастурбация в отношениях?", arrayOf(
                "Конечно, это нормально",
                "Если не часто, то да",
                "Нет",
                "Мастурбация для меня почти как измена",
                "Можно, если в тайне от партнёра",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете, что вас отличает от большинства людей?", arrayOf(
                "Мышление и стремление к развитию, стараюсь найти таких же людей или лучше",
                "Ничего, считаю, что я такой же, как и большинство",
                "Люблю неформально выглядеть и говорить",
                "Практически всё отличает меня от большинства",
                "Те, кто считают, что отличаются от большинства людей всего лишь люди с кучей комплексов",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете есть ли у вас комплексы?", arrayOf(
                "Да и очень много",
                "У всех они есть, просто все их пытаются скрыть",
                "От комплексов, которые мне мешали жить, я избавился",
                "Нет и не было",
                "Затрудняюсь ответить",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы верите в магию/гадание/гороскопы?", arrayOf(
                "Да",
                "Если предсказания хорошие, то да",
                "Отношусь скептически",
                "Не верю, но раньше верил",
                "Никогда в это не верил",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вас может раздражать в партнёре бытовая неаккуратность либо неряшливость?", arrayOf(
                "Да сильно, так как я очень брезгливый и аккуратный человек",
                "Да, постоянно буду ему на это указывать",
                "Смотря, какая степень неряшливости и неаккуратности",
                "Думаю, нет",
                "Я сам такой поэтому мне всё равно",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если бы вы были единственным подходящим донором для своего партнёра, отдали бы вы свою почку если от этого зависела его жизнь?",
            arrayOf(
                "Да",
                "Нет"
            )
        ),
        QuestionWithVariants(
            "Много времени вы проводите в интернете и с какой целью?", arrayOf(
                "Почти всё время, общение развлечения",
                "Много, но в основном с пользой, для поиска информации",
                "Интернет одно из лучших изобретений человечества там можно делать всё и всегда",
                "Редко, только мессенджеры в телефоне",
                "Вообще не пользуюсь интернетом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "У вас много друзей?", arrayOf(
                "У меня нет друзей, только знакомые",
                "Один друг",
                "Много",
                "Несколько лучших друзей",
                "Я вообще не общительный и друзей нет",
                "Нет, но хотелось бы"
            )
        )
    )
    val Part3 = arrayOf(
        QuestionWithVariants(
            "Как вы думаете, сможете ли вы через 5 лет иметь всегда высокий и стабильный доход?",
            arrayOf(
                "Да, смогу",
                "Буду очень стараться",
                "С моей ситуацией это невозможно",
                "Меня это не интересует",
                "Я уже живу в достатке и надеюсь через 5 лет будет только лучше",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Любите ли вы читать?", arrayOf(
                "Да, читаю художественные книги",
                "Да читаю в основном про личную эффективность и психологию",
                "Читаю в основном различные новости",
                "Читаю развлекательный контент в интернете",
                "Читаю много и различные темы",
                "Не люблю читать",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вам нравилось ходить в школу и получать новые знания?", arrayOf(
                "Да, я старался и был отличником",
                "Сначала да, потом стало не интересно",
                "Когда как",
                "Считаю, что наш уровень образования и его подача отбивает иногда желание учиться у детей",
                "Нет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какие предметы вам нравились в школе больше всех?", arrayOf(
                "В принципе, все",
                "Точные науки",
                "Гуманитарные науки",
                "Физкультура, труд, рисование",
                "У меня часто менялись вкусы на любимые предметы",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы себя считаете умным человеком?", arrayOf(
                "Да, но развиваться ещё есть куда",
                "Достаточно умён и профессионален в своей сфере работы, остальное не важно",
                "Нет, все умные - зануды!",
                "Не знаю",
                "Другой ответ"
            )
        ),
        /*QuestionWithVariants(
            "Как вы считаете кто более умён вы или ваш партнёр?", arrayOf(
                "Я всё-таки умнее",
                "Партнёр умнее меня",
                "В чём-то я умнее в чём-то партнёр, так и дополняем друг друга",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете высшее образование и красный диплом это признак ума и интеллекта человека?",
            arrayOf(
                "Конечно",
                "Если он действительно учился и закончил учёбу без посторонней помощи, то да",
                "Не факт, человек может быть начитанным и знать свою профессию на отлично, но быть глупым по жизни",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к людям у которых нет полного образования либо учились в ПТУ?",
            arrayOf(
                "Отлично",
                "Нормально",
                "Смотря чем, они в итоге занимаются",
                "Мне с ними не интересно",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы много времени уделяете своей работе?", arrayOf(
                "Да, работаю почти без выходных",
                "Нет, всё в меру",
                "По настроению",
                "У меня не нормированный график. Иногда много, иногда нет.",
                "Я не работаю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы довольны своей работой?", arrayOf(
                "Да очень",
                "Да, но всё-таки думаю сменить вид деятельности",
                "Уже привык, главное стабильность",
                "Не доволен, ищу другую",
                "Ненавижу свою работу",
                "Я не работаю сейчас",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете вы работаете по призванию?", arrayOf(
                "Да моя работа — это моё призвание",
                "Нет, я считаю я предназначен для другого",
                "Я стремлюсь к этому",
                "Я считаю, что у меня нет талантов, работаю, где могу",
                "Я не работаю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы довольны работой своего партнёра?", arrayOf(
                "Да, вполне",
                "Нет",
                "Главное, что бы ему нравилось",
                "Говорю ему что бы сменил",
                "Он не работает",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если была бы возможность, вы бы открыли общее дело с вашим партнёром?", arrayOf(
                "Конечно, мы бы были отличной командой",
                "Нельзя смешивать отношения и работу",
                "Нет, я не люблю брать на себя много обязанностей",
                "Я не уверен в партнёре и в его ответственности",
                "Была бы возможность, я один бы этим занялся, без партнёра",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Какие темы для разговора вы больше всего обсуждаете в социуме?", arrayOf(
                "Абсолютно разные от появления человечества до новых технологий, я всегда люблю узнавать новое и это обсуждать",
                "В основном о работе и семье",
                "Предпочитаю молчать",
                "Говорю обычно о своих планах, увлечениях",
                "В основном люблю сначала слушать что бы понимать, о чем можно поговорить с конкретными людьми",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к себе?", arrayOf(
                "Уважаю и люблю",
                "Я очень критично к себе отношусь",
                "Хорошо",
                "Нейтрально",
                "Как и ко всем остальным",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Много ли у вас друзей?", arrayOf(
                "Много, больше пяти",
                "Один друг и этого достаточно",
                "У меня нет друзей, только знакомые",
                "Мои друзья – только близкие родственники",
                "Нормально, от двух до четырёх",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы обычно ведёте себя в компании?", arrayOf(
                "Только с хорошо знакомыми людьми веду себя естественно и весело",
                "Обычно мало говорю, больше слушаю",
                "Привлекаете к себе внимание и много говорите на разные темы в любой компании",
                "По настроению",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если вас грубо оскорбят не знакомые вам люди, что вы сделаете?", arrayOf(
                "Отвечу тем же",
                "Не обращу внимания на оскорбление",
                "Переведу в шутку, но тем самым тоже постараюсь задеть оппонента",
                "Запомню и отомщу позже если будет возможность",
                "Дам леща (ударю)",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете, насколько вы здоровый человек?", arrayOf(
                "У меня отличное здоровье, не болею",
                "Плохое, часто болею",
                "Болею в пределах нормы",
                "Очень редко что-то беспокоит",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Сколько лет вы бы хотели прожить?", arrayOf(
                "Сколько получится",
                "Хотел бы хотя бы до пенсии дожить",
                "Максимально долго",
                "40-50 лет, больше – неинтересно",
                "Больше 100 лет",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Занимаетесь ли вы каким, либо спортом?", arrayOf(
                "Занимаюсь для поддержания тонуса и здоровья",
                "Нет, мне не нравится",
                "Нет, нету времени",
                "Сейчас пока нет, но планирую",
                "Занимаюсь профессионально",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы любите поесть?", arrayOf(
                "Да, ем много, ем всё, не слежу за питанием",
                "Люблю только вкусную еду",
                "Я вегетарианец",
                "Ем мало – слежу за фигурой",
                "Не питаю особой любви к еде",
                "Могу есть всё, но нравится, когда еда полезная и вкусная",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к полным людям?", arrayOf(
                "Мне нравятся люди с формами, но не через чур",
                "Как и к другим людям, внешность для меня не важна",
                "Я считаю это отклонением в пищевом поведении или есть проблема, в здоровье которую нужно решать",
                "Считаю их просто ленивыми",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы когда – ни будь переносили тяжелое заболевание опасное для жизни или сложные операции?",
            arrayOf(
                "Да, остались последствия",
                "Нет",
                "Было средней тяжести без особых последствий",
                "Не помню",
                "Были только легкие заболевания/операции",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете должны ли партнёры спать отдельно что бы хорошо выспаться?", arrayOf(
                "Да, но редко",
                "Да, всегда",
                "Нет, если партнёры спят отдельно значит у них что-то не так",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Есть ли у вас вредные привычки курение, алкоголь, наркотики?", arrayOf(
                "Есть, почти все, которые существуют, без них скучно",
                "Есть но пытаюсь избавиться",
                "Нет",
                "Скорее это не привычки у меня, а периодическое веселье",
                "Есть одна или две вредных привычки",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы относитесь к различным модификациям тела (тату, пирсинг и т.д.)?", arrayOf(
                "Считаю это искусством, если сделано профессионально, но себе не хочу",
                "Отлично у меня есть и много",
                "Считаю, что люди себе этим просто портят тело",
                "Хорошо, если в меру",
                "Хочу себе сделать что – ни будь из этого",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Где бы вы могли достать большие деньги по вашему мнению?", arrayOf(
                "Быть очень востребованным профессионалом своего дела и заработать",
                "Иметь и развивать успешный бизнес",
                "Украсть",
                "Всё украдено до нас, их негде взять",
                "Думаю, многим людям, это просто не реально",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как часто и что вы думаете о деньгах?", arrayOf(
                "Часто и расстраиваюсь иногда что у меня их не много",
                "Не часто, они для меня не в приоритете",
                "Думаю, не о деньгах скорее, а о способах заработка",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "На что вы потратили свои первые заработанные деньги?", arrayOf(
                "На развлечения",
                "На себя и свои нужды",
                "Поделился с родственниками/друзьями",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы часто берёте в долг?", arrayOf(
                "Не беру вообще, это допускаю только в экстренном и безвыходном случае",
                "Бывает редко",
                "Беру часто так как не хватает денег",
                "Долгов много",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы уволились с работы или прекратили бы заниматься тем делом, которым занимаетесь сейчас, если у вас бы появилось много денег?",
            arrayOf(
                "Да и жил бы в свое удовольствие",
                "Нет, мне нравится, чем я занимаюсь",
                "Да, но занялся бы тем делом, которое было бы по душе",
                "Мне не откуда сейчас увольняться и нет дел",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Надо ли помогать своим родителям деньгами?", arrayOf(
                "Надо, но только если совсем они не могут прожить на свои",
                "Не обязательно",
                "Можно если есть лишние",
                "Надо в любом случае",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если у вас совсем не окажется денег, что вы будете делать?", arrayOf(
                "Буду всеми силами искать источник дохода",
                "Возьму сначала в долг потом отдам",
                "Возьму у близких родственников безвозмездно",
                "Ничего, потерплю",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы думаете сколько раз в месяц нужно ходить на «шоппинг»?", arrayOf(
                "Не обязательно каждый месяц — это делать",
                "Раз в месяц точно",
                "Я это делаю только по острой необходимости",
                "Пару раз в месяц",
                "Я «шопоголик» чем чаще, тем лучше",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Вы бы экономили на себе в пользу вашего партнёра?", arrayOf(
                "Да, мне важнее позаботится о любимом человеке",
                "Нет, не могу экономить на себе в пользу других",
                "Могу, но только в необходимых случаях",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете, должен ли мужчина платить в ресторане, кино и т.д. за свою женщину?",
            arrayOf(
                "Да, должен",
                "Только если он захочет",
                "Необязательно",
                "Не должен, лучше, когда каждый за себя платит",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Если бы вы были очень богатым человеком подписывали бы брачный контракт со своим партнёром перед свадьбой?",
            arrayOf(
                "Да, никогда ничего не предугадаешь",
                "Нужно выбирать правильного партнёра что бы быть в нём уверенным и такое не допускать",
                "Даже не думал бы об этом",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как вы считаете, должны ли партнёры выплачивать за друг друга ипотеку, кредиты, долги?",
            arrayOf(
                "Да, должны",
                "Только если они в браке и это семья с детьми, а так нет",
                "Если один из партнёров действительно не может заплатить и у него проблемы, то можно помочь",
                "Нет если я к этому не имею отношения, и партнёр все это брал без моего участия",
                "Другой ответ"
            )
        ),
        QuestionWithVariants(
            "Как в семье должен вестись бюджет по вашему мнению?", arrayOf(
                "Должен быть общий бюджет в одном месте и по согласию сторон его тратить на семью",
                "Помимо общего бюджета должны быть личные деньги для ухода за собой или на свои хобби",
                "У каждого свой бюджет, так удобнее",
                "Другой ответ"
            )
        )*/
    )
}